import Notiflix from 'notiflix';

const form = document.querySelector('#search-form');
const gallery = document.querySelector('.gallery');
const loadMoreBtn = document.querySelector('.load-more');

// 	Your API key: 52609803-933344cf37d0c6144f6fe0bf2

// Список параметрів рядка запиту, які тобі обов'язково
// необхідно вказати:

// key - твій унікальний ключ доступу до API.
// q - термін для пошуку.Те, що буде вводити користувач.
// image_type - тип зображення.На потрібні тільки фотографії, тому постав значення photo.
// orientation - орієнтація фотографії.Постав значення horizontal.
// safesearch - фільтр за віком.Постав значення true.
// У відповіді буде масив зображень, що задовольнили критерії параметрів запиту.
// Кожне зображення описується об'єктом, з якого тобі цікаві тільки наступні властивості:

// webformatURL - посилання на маленьке зображення для списку карток.
// largeImageURL - посилання на велике зображення.
// tags - рядок з описом зображення.Підійде для атрибуту alt.
// likes - кількість лайків.
// views - кількість переглядів.
// comments - кількість коментарів.
// downloads - кількість завантажень.
// Якщо бекенд повертає порожній масив, значить нічого підходящого
// не було знайдено.У такому разі показуй повідомлення з
// текстом "Sorry, there are no images matching your search
// query. Please try again.".Для повідомлень використовуй
// бібліотеку notiflix.